Revit 2027 API
BuiltInFailures.InfillFailures.InfillCannotChangeType Property
 Infilling element replaced by a later phase insert must be the same type as the insert's host.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InfillCannotChangeType { get; }
Public Shared ReadOnly Property InfillCannotChangeType As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InfillCannotChangeType {
	FailureDefinitionId^ get ();
}
static member InfillCannotChangeType : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.InfillFailures Class
Autodesk.Revit.DB Namespace